In [2]:
#import libaries 
import pandas as pd 
import numpy as np

In [4]:
#Read CSV file 
df = pd.read_csv('Salaries.csv')

In [61]:
#List first 5 records
df.head()

   rank discipline  phd  service   sex  salary
0  Prof          B   56       49  Male  186960
1  Prof          A   12        6  Male   93000
2  Prof          A   23       20  Male  110515
3  Prof          A   40       31  Male  131205
4  Prof          B   20       18  Male  104800

In [62]:
#Get the overview of dataset
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 78 entries, 0 to 77
Data columns (total 6 columns):
rank          78 non-null object
discipline    78 non-null object
phd           78 non-null int64
service       78 non-null int64
sex           78 non-null object
salary        78 non-null int64
dtypes: int64(3), object(3)
memory usage: 3.8+ KB

In [8]:
#Check a particular column type
df['salary'].dtype

dtype('int64')

In [11]:
#Check types for all the columns
df.dtypes

rank          object
discipline    object
phd            int64
service        int64
sex           object
salary         int64
dtype: object

In [13]:
#Data Frames: Slicing
#Select column salary:
df['salary']

0     186960
1      93000
2     110515
3     131205
4     104800
       ...
73    105450
74    104542
75    124312
76    109954
77    109646
Name: salary, Length: 78, dtype: int64

In [15]:
#Select column Rank and salary:
df[['salary','rank']]

    salary       rank
0   186960       Prof
1    93000       Prof
2   110515       Prof
3   131205       Prof
4   104800       Prof
..     ...        ...
73  105450       Prof
74  104542  AssocProf
75  124312       Prof
76  109954       Prof
77  109646       Prof

[78 rows x 2 columns]

In [19]:
#Select rows by their labels:
df.iloc[10:20]

        rank discipline  phd  service   sex  salary
10      Prof          B   39       33  Male  128250
11      Prof          B   23       23  Male  134778
12  AsstProf          B    1        0  Male   88000
13      Prof          B   35       33  Male  162200
14      Prof          B   25       19  Male  153750
15      Prof          B   17        3  Male  150480
16  AsstProf          B    8        3  Male   75044
17  AsstProf          B    4        0  Male   92000
18      Prof          A   19        7  Male  107300
19      Prof          A   29       27  Male  150500

In [21]:
#Select rows by their labels:
df.iloc[10:20,[0, 3, 4, 5]]

        rank  service   sex  salary
10      Prof       33  Male  128250
11      Prof       23  Male  134778
12  AsstProf        0  Male   88000
13      Prof       33  Male  162200
14      Prof       19  Male  153750
15      Prof        3  Male  150480
16  AsstProf        3  Male   75044
17  AsstProf        0  Male   92000
18      Prof        7  Male  107300
19      Prof       27  Male  150500

In [23]:
df.loc[10:20,['rank','sex','salary']]

        rank   sex  salary
10      Prof  Male  128250
11      Prof  Male  134778
12  AsstProf  Male   88000
13      Prof  Male  162200
14      Prof  Male  153750
15      Prof  Male  150480
16  AsstProf  Male   75044
17  AsstProf  Male   92000
18      Prof  Male  107300
19      Prof  Male  150500
20  AsstProf  Male   92000

In [25]:
#First row of a data frame
df.iloc[0]

rank            Prof
discipline         B
phd               56
service           49
sex             Male
salary        186960
Name: 0, dtype: object

In [27]:
#nth row of Data Frame 
df.iloc[4]

rank            Prof
discipline         B
phd               20
service           18
sex             Male
salary        104800
Name: 4, dtype: object

In [29]:
#Last Row of Data Frame 
df.iloc[-1]

rank            Prof
discipline         A
phd               23
service           15
sex           Female
salary        109646
Name: 77, dtype: object

In [30]:
 # First column of the Data Frame
df.iloc[:, 0]

0          Prof
1          Prof
2          Prof
3          Prof
4          Prof
        ...
73         Prof
74    AssocProf
75         Prof
76         Prof
77         Prof
Name: rank, Length: 78, dtype: object

In [32]:
 # Last column of the Data Frame
df.iloc[:,-1]

0     186960
1      93000
2     110515
3     131205
4     104800
       ...
73    105450
74    104542
75    124312
76    109954
77    109646
Name: salary, Length: 78, dtype: int64

In [34]:
#First 7 rows 
df.iloc[0:7]

        rank discipline  phd  service   sex  salary
0       Prof          B   56       49  Male  186960
1       Prof          A   12        6  Male   93000
2       Prof          A   23       20  Male  110515
3       Prof          A   40       31  Male  131205
4       Prof          B   20       18  Male  104800
5       Prof          A   20       20  Male  122400
6  AssocProf          A   20       17  Male   81285

In [36]:
 #First 2 columns
df.iloc[:, 0:2]

         rank discipline
0        Prof          B
1        Prof          A
2        Prof          A
3        Prof          A
4        Prof          B
..        ...        ...
73       Prof          B
74  AssocProf          B
75       Prof          B
76       Prof          A
77       Prof          A

[78 rows x 2 columns]

In [38]:
df.iloc[1:3, 0:2]  #Second through third rows and first 2 columns

   rank discipline
1  Prof          A
2  Prof          A

In [40]:
df.iloc[[0,5], [1,3]]  #1st and 6th rows and 2nd and 4th columns

  discipline  service
0          B       49
5          A       20

In [42]:
# Create a new data frame from the orginal sorted by the column Service
df_sorted = df.sort_values(by ='service')
df_sorted.head()

        rank discipline  phd  service     sex  salary
55  AsstProf          A    2        0  Female   72500
23  AsstProf          A    2        0    Male   85000
43  AsstProf          B    5        0  Female   77000
17  AsstProf          B    4        0    Male   92000
12  AsstProf          B    1        0    Male   88000

In [44]:
# Create a new data frame from the original sorted by the column Salary
df_sorted = df.sort_values(by ='salary')
df_sorted.head()

         rank discipline  phd  service     sex  salary
9        Prof          A   51       51    Male   57800
54  AssocProf          A   25       22  Female   62884
66   AsstProf          A    7        6  Female   63100
71  AssocProf          B   12        9  Female   71065
57   AsstProf          A    3        1  Female   72500

In [46]:
#We can sort the data using 2 or more columns
df_sorted = df.sort_values( by =['service', 'salary'], ascending = [True, False])
df_sorted.head(10)

        rank discipline  phd  service     sex  salary
52      Prof          A   12        0  Female  105000
17  AsstProf          B    4        0    Male   92000
12  AsstProf          B    1        0    Male   88000
23  AsstProf          A    2        0    Male   85000
43  AsstProf          B    5        0  Female   77000
55  AsstProf          A    2        0  Female   72500
57  AsstProf          A    3        1  Female   72500
28  AsstProf          B    7        2    Male   91300
42  AsstProf          B    4        2  Female   80225
68  AsstProf          A    4        2  Female   77500

In [48]:
#Maximum value of Sepecific column
df['salary'].max()

186960

In [50]:
#Minimum value of Sepecific column
df['salary'].min()

57800

In [51]:
#Mean value of Sepecific column
df['salary'].mean()

108023.78205128205

In [53]:
#Mode value of Sepecific column
df['salary'].mode()

0    92000
dtype: int64

In [55]:
#Median value of Sepecific column
df['salary'].median()

104671.0

In [57]:
#variance of Sepecific column
df['salary'].var()

800531254.0427907

In [60]:
#standard deviation of Sepecific column
df['salary'].std()

28293.66102226417

In [65]:
#Staristical info in one function 
df['salary'].describe()

count        78.000000
mean     108023.782051
std       28293.661022
min       57800.000000
25%       88612.500000
50%      104671.000000
75%      126774.750000
max      186960.000000
Name: salary, dtype: float64

In [66]:
#Calculate mean salary for each professor rank:
df.groupby(['rank'], sort=False)[['salary']].mean()

                  salary
rank
Prof       123624.804348
AssocProf   91786.230769
AsstProf    81362.789474